; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v10)
             (pred_1 ?v5 ?v8)
             (pred_8 ?v11 ?v8)
             (pred_9 ?v3 ?v11 )
	     (pred_3 ?v11)
             (pred_2 ?v9)
             (pred_5 ?v5)
             (pred_6 ?v8)
             (pred_12 ?v11)
             (pred_4 ?v5)
             (pred_10 ?v11)
             (pred_11 ))



(:action op_5
:parameters (?v12 ?v7 ?v13 ?v6)
:precondition (and (pred_2 ?v12) (pred_2 ?v7) (pred_5 ?v13) (pred_6 ?v6)
          (pred_7 ?v12 ?v7) (pred_1 ?v13 ?v6)
                   (pred_8 ?v7 ?v6) (pred_3 ?v12) 
                   (pred_12 ?v7) (pred_4 ?v13))
:effect (and  (pred_10 ?v7) (not (pred_12 ?v7))))


(:action op_4
:parameters (?v12 ?v2)
:precondition (and (pred_2 ?v12) (pred_2 ?v2)
               (pred_3 ?v12) (pred_7 ?v12 ?v2) (pred_10 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v12))))

(:action op_1
:parameters (?v12 ?v13)
:precondition (and (pred_2 ?v12) (pred_5 ?v13) 
                  (pred_3 ?v12) (pred_9 ?v13 ?v12) (pred_11 ))
:effect (and (pred_4 ?v13)
   (not (pred_9 ?v13 ?v12)) (not (pred_11 ))))


(:action op_2
:parameters (?v12 ?v4 ?v1)
:precondition (and (pred_2 ?v12) (pred_5 ?v4) (pred_5 ?v1)
                  (pred_3 ?v12) (pred_4 ?v1) (pred_9 ?v4 ?v12))
:effect (and (pred_4 ?v4) (pred_9 ?v1 ?v12)
        (not (pred_4 ?v1)) (not (pred_9 ?v4 ?v12))))

(:action op_3
:parameters (?v12 ?v13)
:precondition (and (pred_2 ?v12) (pred_5 ?v13) 
                  (pred_3 ?v12) (pred_4 ?v13))
:effect (and (pred_11 ) (pred_9 ?v13 ?v12) (not (pred_4 ?v13)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_17 obj_11 obj_02 obj_19 obj_20 obj_09 obj_04 obj_16 obj_06 obj_03 obj_14 obj_12 obj_08 obj_05 obj_07
    obj_15 obj_01
    obj_13 obj_18
    )

    (:init
       (pred_11)

       (pred_2 obj_10)
       (pred_2 obj_17)
       (pred_2 obj_11)
       (pred_2 obj_02)
       (pred_2 obj_19)
       (pred_2 obj_20)
       (pred_2 obj_09)
       (pred_2 obj_04)
       (pred_2 obj_16)
       (pred_2 obj_06)
       (pred_2 obj_03)
       (pred_2 obj_14)
       (pred_2 obj_12)
       (pred_2 obj_08)
       (pred_2 obj_05)
       (pred_2 obj_07)
       (pred_6 obj_15)
       (pred_6 obj_01)
       (pred_5 obj_13)
       (pred_5 obj_18)

       (pred_7 obj_10 obj_19)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_17 obj_20)
       (pred_7 obj_17 obj_11)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_11 obj_09)
       (pred_7 obj_11 obj_02)
       (pred_7 obj_11 obj_17)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_02 obj_11)
       (pred_7 obj_19 obj_16)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_19 obj_10)
       (pred_7 obj_20 obj_06)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_20 obj_17)
       (pred_7 obj_20 obj_19)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_11)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_16 obj_12)
       (pred_7 obj_16 obj_06)
       (pred_7 obj_16 obj_19)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_06 obj_20)
       (pred_7 obj_06 obj_16)
       (pred_7 obj_03 obj_05)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_14 obj_07)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_12 obj_16)
       (pred_7 obj_08 obj_05)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_05 obj_08)
       (pred_7 obj_07 obj_14)
       (pred_7 obj_07 obj_05)
       (pred_12 obj_02)
       (pred_12 obj_04)
       (pred_8  obj_02 obj_15)
       (pred_8  obj_04 obj_01)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_09)
       (pred_10 obj_16)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_14)
       (pred_10 obj_12)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_07)

       (pred_1  obj_13 obj_15)
       (pred_1  obj_18 obj_01)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_18 obj_10)
       (pred_3 obj_07)
    )

    (:goal (and
       (pred_9 obj_13 obj_05)
    ))
(:constraints
  (always (not (pred_3 obj_03)))
)
)

; plan
1. (op_4 obj_07 obj_14)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_14)
   goals met: 0 of 1
2. (op_1 obj_14 obj_13)
   deleted: (pred_9 obj_13 obj_14) (pred_11)
   added: (pred_4 obj_13)
   goals met: 0 of 1
3. (op_4 obj_14 obj_07)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_07)
   goals met: 0 of 1
4. (op_4 obj_07 obj_05)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_05)
   goals met: 0 of 1
5. (op_3 obj_05 obj_13)
   deleted: (pred_4 obj_13)
   added: (pred_11) (pred_9 obj_13 obj_05)
   goals met: 1 of 1
